to 89254
the 81939
you 65208
I 48977
and 43613
for 38698
a 33972
it 31039
your 28219
is 27925
app 27726
me 23572
this 22488
can 20779
of 20456
have 20061
at 19939
my 17656
that 17567
with 17427
in 17391
Jenny 16694
on 15209
we 14887
so 13827
be 13453
Hi 12615
are 12461
Thank 12060
not 12057
an 11725
will 10891
would 10749
help 10582
us 9930
We 9758
but 9292
migraine 9163
if 9140
or 8754
jenny@healint.com 8618
It 8457
contact 8108
Dear 7646
like 7621
email 7409
track 7360
very 7211
how 7183
as 6906
sleep 6888
when 6666
was 6654
app. 6488
much 6340
use 6332
more 6143
stars 6121
You 5946
Thanks 5858
The 5832
time 5767
migraines 5745
This 5717
do 5655
get 5567
know 5530
data 5308
give 5195
need 5126
Please 5048
:) 5039
able 5020
free 4960
If 4922
what 4883
let 4717
could 4623
record 4556
our 4550
working 4544
great 4523
hope 4468
from 4457
love 4401
out 4366
all 4357
new 4309
please 4257
about 4188
hear 4176
see 4167
has 4163
make 3992
been 3926
5 3912
I'm 3836
try 3822
support 3814
many 3808
really 3745
by 3699
Migraine 3699
back 3581
no 3572
one 3567
another 3560
it's 3545
account 3531
work 3521
improve 3265
just 3216
you! 3214
any 3203
there 3167
now 3162
pain 3096
Buddy 3049
can't 3025
tracking 3006
also 2995
log 2985
way 2976
since 2946
up 2926
create 2921
which 2913
understand 2909
update 2900
phone 2898
Jenny@healint.com 2889
migraines. 2880
even 2846
star 2838
find 2836
because 2799
keep 2779
access 2767
you. 2764
code 2761
sorry 2695
thank 2684
still 2683
it. 2675
feel 2660
some 2645
add 2621
helps 2570
helpful 2570
using 2517
better 2450
look 2447
easy 2404
only 2380
good 2380
- 2337
had 2325
It's 2292
should 2280
then 2278
problem 2263
jenny@healint.com. 2260
migraine. 2244
triggers 2239
missing 2234
:-) 2233
review 2218
am 2209
send 2206
doesn't 2160
into 2144
app, 2143
take 2106
than 2070
want 2013
don't 2001
But 1978
won't 1973
were 1954
days 1915
cannot 1912
3 1902
who 1898
removed 1896
Could 1895
used 1882
assist 1882
further 1864
tried 1863
most 1863
i 1861
hard 1847
Feel 1818
Your 1813
going 1811
best 1804
Can 1789
Hope 1769
My 1764
having 1758
Great 1747
wish 1736
updated 1736
Do 1722
usually 1721
Very 1711
I've 1704
directly 1704
daily 1699
fix 1698
users 1697
glad 1691
other 1681
lot 1667
may 1666
try! 1659
last 1649
does 1647
issue 1646
rating 1646
after 1642
2 1634
version 1612
times 1607
app! 1600
team 1578
discuss 1568
feedback 1561
put 1560
option 1557
happy 1550
sure 1537
perfect 1517
So 1503
suggestions 1466
Glad 1464
check 1439
battery 1439
go 1435
& 1428
start 1425
developers 1422
forward 1416
doctor 1398
it, 1393
me. 1386
Sorry 1384
A 1383
different 1379
thanks 1371
headache 1370
did 1367
feedback. 1363
didn't 1362
allow 1353
people 1352
export 1352
needs 1349
they 1342
without 1336
experience 1333
day 1300
Thanks! 1297
information 1293
section 1278
its 1278
tool 1271
think 1270
useful 1269
off 1261
open 1250
user 1250
actually 1244
apps 1235
change 1235
recording 1234
helping 1217
every 1215
until 1212
fixed 1209
those 1189
well 1184
found 1178
improvements. 1175
medication 1170
doctors 1170
while 1165
over 1164
multiple 1164
made 1150
getting 1150
Not 1150
end 1148
triggers. 1142
weather 1131
bad 1127
says 1124
notes 1119
why 1119
info 1116
problems 1116
bug 1113
. 1111
Now 1110
There 1109
Would 1102
makes 1088
anything 1087
Google 1081
share 1080
tracker 1080
headaches 1076
symptoms 1069
data. 1065
down 1063
note 1062
you? 1060
Have 1059
them 1058
everything 1055
reports 1049
again 1037
screen 1035
such 1031
chat 1030
feature 1027
seems 1017
intensity 1017
earn 1017
show 1016
location 1010
contact@healint.com 1009
before 1004
^^ 999
grab 998
http://m.me/migrainebuddy 995
turn 989
improvements 988
same 985
enough 984
details 983
trying 981
helped 978
bugs 976
:( 976
review. 972
For 970
never 966
Love 963
triggers, 944
encourage 943
that. 942
keeps 940
device 940
too 939
latest 939
helpful. 937
solve 932
major 926
this. 922
long 919
started 908
kind 906
things 905
issue. 903
I'd 903
it! 898
address. 894
problem. 887
use. 886
worth 880
often 878
lost 878
mean 876
=) 875
all. 873
! 868
facing 867
time. 866
always 862
well. 859
App 856
worked 847
enter 844
day. 842
being 838
right 824
few 823
changes 820
e-mail 817
their 814
now. 814
come 807
first 803
Just 796
write 796
headaches. 794
read 793
As 786
(ˆ_ˆ) 786
keeping 783
app? 783
update. 782
caused. 782
inconvenience 781
far 778
Samsung 770
improving 770
something 768
requirement 766
In 761
migraines, 759
patients 759
provide 754
review! 746
via 745
possible 742
thing 742
assistance 739
Also 738
works 733
stopped 732
during 731
detection 728
chronic 724
reach 721
support@healint.com 720
two 719
email. 718
reason 718
each 716
finding 716
phone. 714
No 714
through 713
Edit 712
Can't 712
Easy 707
loved 705
experience. 704
downloaded 702
currently 701
food 698
nothing 695
definitely 690
Looking 688
sleep. 688
once 686
nice 683
Hi, 682
download 682
giving 681
doing 679
exactly 677
fifth 672
level 672
records 671
here 670
sufferers. 669
out. 668
doctor. 667
main 667
stars. 667
options 665
next 665
available 663
5-star 663
work. 658
tracks 658
After 658
recorded 656
in. 655
manage 650
support. 649
trigger 649
recommend 647
meds 646
Francois 646
potential 645
easier 645
diary 641
looking 636
Android 635
important 633
sleep, 630
amount 626
How 625
facebook 623
function 622
, 621
longer 619
ability 618
simply 618
entry 614
solution 611
And 610
faster. 606
Did 595
accurate 593
eventually? 593
What 591
Sleep 588
set 587
specific 587
including 583
what's 583
Then 580
along 580
ask 577
devices 575
play 574
little 573
issues 573
notifications 573
touch 572
several 571
figure 564
questions 562
got 562
suggestion 562
uninstall 559
where 553
saying 553
rating. 548
address 547
chance 546
caused 546
isn't 544
case 544
causing 542
face 541
assistance. 534
them. 533
push 529
update, 528
support! 526
? 525
Facebook 525
phones 524
medical 523
problem, 523
wake 522
hours 522
feedback! 519
4 518
part 517
writing 517
own 516
soon 516
extremely 516
thought 515
1 511
error 510
notification 510
migraine, 509
settings 508
might 507
night 505
help. 505
button 504
Our 501
better. 500
not, 498
faster! 497
however 496
recent 495
took 493
disappointed 490
bit 487
input 485
reviews 483
anymore 483
time, 482
full 482
Otherwise, 482
manually 482
top 481
needed 479
on. 478
later 477
feature, 477
patterns 476
automatic 473
try, 473
help! 470
gives 462
However, 461
Tried 461
sign 460
point. 459
coming 458
synchronize 458
jenny@healint.com? 458
updates 457
morning, 457
changing 456
day, 453
quite 451
us. 451
sometimes 447
May 447
google 447
neurologist 446
simple 445
Many 443
location. 443
now, 442
these 442
goes 441
already 441
pretty 441
cant 441
suffer 440
making 440
automatically 435
date 435
در 435
serious 434
anymore. 434
requires 433
else 433
updating 433
account. 429
rectified 429
back. 425
Wishing 425
To 425
features 424
working. 420
current 419
anyone 418
section. 418
happened 418
attack 417
comment. 416
point 414
crashing 413
Notes 413
broken 412
middle 411
med 411
means 411
reset 411
around 410
explain 407
entered. 407
server 407
need? 407
Does 406
We're 406
remove 404
etc. 403
problems. 403
we've 402
Usually 402
month 401
options. 401
crashes 401
big 400
drop 400
accept 400
you're 399
technical 397
10 397
question 397
exact 397
showing 397
given 395
though 394
services 394
between 393
adjust 392
helpful! 391
identify 390
logging 388
you, 387
rather 386
password 386
yet 385
gave 383
quick 380
prove 380
period 379
whether 379
e. 378
forget 378
useful. 377
retrieve 377
within 376
message 375
losing 375
almost 375
fine 373
asks 373
message. 373
reinstall 373
told 372
1-star 372
Yes, 370
possible. 369
cause 368
Jennifer, 368
Play. 366
Since 366
relief 365
tracker. 365
NOT 365
her 365
galaxy 365
force 365
ever 364
encouraging 362
sync 362
tell 362
connection 362
(@@ 361
Maybe 361
hopefully 360
sleeping 360
throughout 360
Thanks. 359
further. 357
years 356
Working 356
internet 354
speed 353
taken 351
head 351
she 351
medications 351
Once 351
friendly. 350
informing 349
me, 348
others 348
به 348
accurately 347
Really 347
Keep 347
Aug 347
asking 347
complicated 346
Meanwhile 345
done, 345
detect 344
out, 343
login 343
due 343
treatment 341
"@@ 341
low 341
it? 341
screen. 340
tested 340
buddy 339
again! 339
continuous 338
When 338
annoying 338
"Daily 338
related 337
idea 337
talk 337
faced 337
dark 336
development 336
fact 334
record. 333
under 333
service 333
paper 333
contacting 333
... 332
timestamps 332
advertising 331
Feb: 330
change. 330
meantime, 329
old 328
past 328
records. 327
tapping 327
report 326
great. 326
android 326
Sarah, 326
constantly 326
again. 324
solving 324
issue? 324
ing 323
!! 323
+ 323
use, 322
export, 322
Only 321
that, 321
=D 320
delete 319
resolve 319
issue, 318
downloading 317
thoughts 317
intake 316
much! 315
Most 315
Jenny@healint.com? 315
jenny@healint.com! 315
support@healint.com? 315
released 315
3/5 315
lose 314
comments 314
Helps 313
Its 313
auto 312
load. 312
detailed 311
both 311
receive 311
s@@ 310
risk 310
wonderful 309
tracking. 309
Is 309
properly 308
logged 308
maybe 307
information. 307
weeks 306
power 305
Like 305
soon. 305
happens 305
loading 305
s 304
starting 304
whenever 303
symptoms, 302
then, 302
then! 302
entering 302
es 301
opportunity 300
again? 300
Why 300
trouble 299
uses 299
week 299
reported 299
requested 299
therefore 298
Best 297
emailing 297
save 297
e! 296
d@@ 296
added 296
Good 296
looks 296
monitor 295
corner 295
unless 295
:-( 294
separate 294
easy. 293
data, 292
adding 291
Will 291
bugs. 291
continual 291
order 290
items 290
— 290
seemed 289
learn 288
friendly 288
confirm 287
improved 287
notice 287
left 286
absolutely 286
either. 286
offer 284
indicate 284
ideas 284
good. 283
moment 283
dont 282
easily 282
fixing 282
least 282
remark. 282
kept 281
users. 281
faster 281
works. 280
missed 280
well! 280
day! 279
allows 278
seem 278
confusing 278
NOTES 278
exported 277
All 276
properly. 276
telling 276
resolved 276
ed 275
medicine 275
existing 275
entry. 275
t@@ 274
lovely 274
pinpoint 273
deactivate 272
We've 272
a! 271
asked 271
seen 271
probably 270
b@@ 270
recommended 270
assistance, 270
someone 270
constant 270
register 270
life 269
questions. 269
minor 269
[Update]: 269
created 268
Play 268
work, 268
calendar 267
link 267
taking 267
Wish 267
Julie, 267
edit: 267
s. 266
number 266
stamp 266
together. 265
anything! 265
(ˆ_ˆ). 265
takes 264
24 264
wouldn't 264
too. 264
appreciate 264
common 264
detail 263
meant 263
types 263
continuously 263
Too 262
second 262
to. 261
anytime 261
synchronise 261
را 261
page 260
best. 260
Keeps 260
bed 260
limited 260
especially 259
30 259
برای 259
ongoing 258
Kindly 258
helps. 257
Michelle, 257
good, 256
(I 256
Also, 256
icon 255
complete 255
Still 254
stop 254
S@@ 254
couldn't 254
Hopefully 253
research 253
enjoy 253
shouldn't 253
headache, 252
lot. 252
single 251
a. 250
Had 250
twice 250
problem? 250
there. 249
liked 249
positive 249
space 248
then? 248
12 248
unable 248
less 247
file 247
everyday. 247
Emily, 247
logging. 247
gets 246
thorough 246
solved? 246
Everything 245
star. 244
patients. 244
certain 243
Elizabeth, 243
comes 243
battery. 242
based 241
y! 241
reflect 241
gone. 241
speak 240
fully 240
include 240
higher 240
test 240
phone? 240
frustrating 239
Has 239
far. 238
T@@ 238
encountered 238
Of 238
much. 238
tips 238
work! 237
there, 237
end. 236
re@@ 236
stars! 236
whatever 236
switch 236
apologise 236
pain. 235
menu 235
Nice 235
communicate 235
one. 235
further? 235
fill 234
e@@ 233
u 233
is. 233
import 233
rare 233
suppose 233
team. 232
you've 232
catch 232
copy 232
Kind 232
However 232
purpose 232
thinks 231
sending 231
close 231
Were 231
neurologist. 230
memory 230
Amy, 230
night. 230
this, 230
type 229
difficult 229
i@@ 229
m@@ 229
immediately 229
while. 229
question, 229
quickly 228
device. 228
further! 228
uninstalled. 228
e, 227
leave 227
noticed 227
inconvenience. 227
millions 227
customize 226
more. 225
everyone 225
short 225
Triggers 225
opt 225
installed 224
online 224
ok 224
SD 224
M@@ 223
Super 223
suggested 223
this? 223
password, 223
managing 222
useless 222
insight 221
away 221
issues, 221
performance 221
connection. 220
process 220
place 220
awesome 220
migraines! 220
devices. 220
previously 220
account? 220
otherwise 219
annoying. 219
poorly 219
down. 218
Some 218
try. 218
capacity 218
backup 218
Ali 218
p@@ 217
unlock 217
deliver 217
Marie, 217
storage 216
medication, 216
manual 216
journal 215
way. 215
rid 215
Used 215
rating? 215
literally 214
/@@ 214
levels 214
apps, 214
goal 214
e 213
pattern 213
HAVE 213
times. 212
heard 212
Joshua, 212
words 211
Healint 211
installing 211
fix. 211
it'll 210
that's 210
days. 210
app- 210
y@@ 209
Susan, 209
supporting 209
everything. 209
wont 209
in@@ 208
beginning 208
manually. 208
hearing 208
attack. 207
users, 207
function, 207
log. 207
indicating 207
section, 206
Im 206
slow 206
Won't 206
y. 205
page. 205
early 205
20 205
we're 205
Note 204
Melissa, 204
that! 204
designed 203
k@@ 203
screen, 203
Heather, 203
pushed 203
treat 202
sufferer 202
reduce 202
logs 202
Data 202
back? 202
though. 201
update: 201
Megan, 201
stays 201
patience. 201
causes 200
Ever 200
location, 199
case. 199
amazing 198
appear 198
fast 198
headaches, 197
im 197
now? 197
sad 197
investigate 197
store 196
star? 196
here: 196
lately 196
francois@healint.com 196
bottom 195
post 195
Unable 195
obtain 195
) 194
C@@ 194
yet, 194
improvement 194
specifically 194
investigating 194
s, 193
lacking 193
ap 193
lasts 193
rated 193
alone 192
" 192
instead 192
select 192
inputting 192
drug 192
days? 192
then. 191
couple 191
move 191
you'll 191
Jenny@healint.com, 191
onset 191
reminders 190
y 190
-@@ 190
continue 190
rest 190
creating 189
Amy! 189
already. 189
IT 189
patience! 189
increasing 189
excellent 188
g@@ 188
doctor, 188
6 188
identifying 188
mention 188
3% 188
feeling 187
a@@ 187
"not 187
that... 187
Give 187
convenient 186
comment 186
file. 186
[Edit] 186
code. 186
timestamp 185
ate 185
there's 185
sharing 185
us! 185
seems. 185
overlaps 185
severity. 185
ing. 184
like. 184
appointments 184
suddenly 184
great, 184
resolving 184
application, 184
Regards, 184
symptoms. 183
design 183
During 183
application 183
an@@ 183
c@@ 183
today 183
Email 183
entries 183
instructions 183
Tracker 183
A@@ 182
option. 182
we'd 182
in, 182
Pls 182
average 182
charge 182
Version 182
e-mail. 182
v@@ 181
al@@ 181
summary 181
un@@ 181
Before 181
First 181
horrible 181
skip 180
disappointing 180
format 179
actual 179
starts 179
synchronisation 179
whole 178
J@@ 178
settings. 178
D@@ 178
ads. 178
Let 178
Dr. 177
from. 177
Ok 177
vote 177
pressure 176
ALL 176
n@@ 176
shows 176
review, 176
bringing 176
html 176
buddy? 176
remember 175
er 175
Cheers, 175
uninstalling 175
(we 175
known 174
awaiting 174
S5 174
، 174
از 174
آن 174
زبان 174
دسترس 174
حال 174
حاضر 174
features. 173
learning 173
deal 173
l@@ 173
on@@ 173
prescription 173
Paul, 173
etc 172
loads 172
changed 172
foods 172
avoid 172
interested 172
Uninstalled 172
Galaxy 172
Update: 172
it@@ 171
es. 171
y, 171
patterns. 171
frequent 171
in! 171
2. 171
crash 171
additional 170
answer 170
K@@ 170
(which 170
At 170
idea, 170
safe 170
severity 169
this! 169
medication. 169
edit 169
analysis 169
One 169
Records 169
1. 169
specially 169
needed. 169
YOUR 169
Battery 169
bug. 169
figuring 168
There's 168
rate 168
affect 168
regular 168
method 168
describe 168
interface 167
L@@ 167
huge 167
Don't 167
uninstalled 167
sd 167
100% 166
reliefs 166
severe 166
migraineurs 166
needs. 166
potentially 166
feedback, 166
Go 166
Play, 166
more! 166
frustrating. 166
incomplete 166
evolution 165
E@@ 165
Should 165
through. 165
duration 165
one, 165
concerns 165
period. 165
French, 165
English. 165
across 164
three 164
pain, 164
t 164
Lee 164
gather 164
stay 164
guys 164
Brian, 164
DO 164
hadn't 163
wait 163
feature. 163
mind 162
excited 162
normal 162
happen 162
discussion 162
received 162
similar 162
comfortable 162
encounter 162
Francois@healint.com 162
attention. 162
B@@ 161
advance. 161
en@@ 161
info. 161
cycle 161
on? 161
soon, 161
: 160
meds, 160
water 160
self 160
awful 160
reports. 160
n 160
track, 160
considered 160
certainly 160
fair 159
st@@ 158
correctly 158
entire 158
Hannah, 158
up, 158
5-stars 158
applied 158
troubleshooting 158
Today 158
regards, 157
set. 157
redownload/update 157
highly 156
anything. 156
Jenny. 156
Tim, 156
We'd 156
signals 156
do? 156
everything? 156
visible 155
sufferers 155
"migraine 155
x 155
morning 155
Sara, 155
saved 155
varying 155
Amanda 155
perfectly 155
countless 155
ed. 154
attacks 154
ot 154
barometric 154
true 154
Nicole, 154
lock 154
normally 154
Trish, 154
changed. 154
opens 154
"feature". 154
Considering 154
"Settings", 154
Settings", 154
Reminder". 154
reminds 153
/ 153
phone, 153
sad. 153
honest 153
paramount 153
H@@ 152
situation. 152
months 152
REALLY 152
prior 152
thousands 152
functioning 152
cumbersome 152
out! 152
solves 152
ive 151
(also 151
An 151
Which 151
yet? 151
likes 151
login? 151
obvious. 151
grateful 150
haven't 150
Feb 150
ago 150
Migraines 150
times, 150
relief, 150
event. 150
stuff. 150
intuitive. 150
Lauren, 150
today. 150
till 150
responding 150
Erica, 150
observe 150
Uninstalling 150
overall 149
10: 149
surprised 149
except 149
Jenny@healint.com. 149
room 149
needing 149
touch. 149
er@@ 148
must 148
interactive 148
once. 148
showed 148
lasted 148
migraines? 148
it- 148
Judy, 148
FB 148
opened 147
frequency 147
improve! 147
patient 147
think. 147
across, 147
avoided 147
isolate 147
Going 147
worries 147
aspects). 147
signal 147
a, 146
R@@ 146
Way 146
screens 146
application. 146
Happy 146
Especially 146
me! 146
Tonya, 146
synchronize. 146
wrong. 146
yet... 146
solved 146
glitch 146
Next 146
h@@ 145
play. 145
is, 145
helps! 145
install 145
stable 145
entry, 145
Pixel 145
XL 145
Cindy, 145
Kristina, 145
promise. 145
cried. 145
respomses 145
gowever 145
budding 145
close" 145
Lisha, 145
mentioned, 145
made! 145
^-^ 145
decent, 145
frank 145
saddens 145
Belinda, 145
worry! 145
methodically 145
Although 144
intuitive, 144
( 144
reserved 144
page: 144
.@@ 143
s! 143
f@@ 143
kindly 143
9.0 143
reasons. 143
solution. 143
report! 143
shutting 143
editing 143
wrong? 143
Buddy. 142
far, 142
correct 142
text 142
wish. 142
e.g. 142
frustrating😠 142
Sally, 142
We's 142
app: 142
frames 142
u@@ 141
comprehensive 141
sensor 141
overview 141
tap 141
letting 141
affects 141
Edited 141
Kelly, 141
disappointing! 141
advertised. 141
initiate 141
adobe 141
midnight. 141
click 140
week. 140
shuting 140
treatment. 140
restart 140
entirely 140
matter. 140
dev 140
edit. 140
indicates 140
worry, 140
Patch, 140
discussion, 140
(^_~) 140
say 139
r@@ 139
health 139
attacks. 139
truly 139
prompted 139
overall. 139
Wendy, 139
export. 139
considering 139
re-enter 139
freezes 139
mid-report 139
save, 139
deletes 139
disappears 139
replaced 139
finished 139
incomplete. 139
imagine, 139
add: 139
cutting 139
offline, 139
:-(. 139
June 139
17: 139
Suggestion: 139
New 139
WiFi. 139
give, 139
consumption 139
Dr 138
customer 138
'@@ 138
"this 138
exists" 138
Vallo, 138
checked 138
features, 138
card 138
external 138
TO 138
"Export". 138
closed. 138
Deborah, 138
complicated? 138
years, 137
emails 137
years. 137
whats 137
solved. 137
time! 137
pull 137
wrong 137
ME 137
back! 137
onset. 137
Chiari 137
complicated. 137
re-installing 137
sophisticated 137
shifts. 137
Carolynne, 137
well.Please 137
video 136
else. 136
o 136
original 136
analyze 136
Even 136
alerts. 136
pop 136
(at 136
DURING 136
Jessica, 136
(ˆ_ˆ)! 136
3h 136
ASAP! 136
Read 136
2-star 136
negatively. 136
hurts 135
Pretty 135
Helpful 135
periods 135
name 135
happen, 135
sent 135
night, 135
precise 135
bothered 135
Joseph, 135
release 135
data? 135
Note. 135
o@@ 134
there! 134
customization 134
results. 134
numerous 134
Barbara, 134
She 134
(your 134
Malformation 134
CAN 134
MORE 134
intensive 134
Renee, 134
boring 134
ensure 134
secure. 134
lost, 134
Crow, 134
unlocking 134
dumb. 134
5mn 134
hemiplegic 133
apparently 133
Need 133
functions 133
Steve, 133
actively 133
pollen 133
HOW 133
ADJUST 133
HOUR 133
DISPLAY 133
REMINDER 133
MIGRAINE. 133
USED 133
OPTIONS. 133
DRIVES 133
CRAZY 133
inputs 133
fake 133
multi-account 133
multi-devices 133
Drains 133
Upset 133
happen! 133
backups. 133
Jenna, 133
password? 133
but: 133
intensify 133
Uninstall, 133
Cory, 133
off- 133
Requested 133
emailed, 133
return, 133
faffing 133
around-uninstalled. 133
PS-x2 133
supposedly 133
same....what 133
coincidence 133
exacerbating 133
real 132
Sometimes 132
before, 132
visit 132
suggest 132
serve 132
95% 132
testing 132
cat 132
however, 132
connecting 132
Good, 132
critique 132
doses 132
justification 132
trail 132
period). 132
Uninstalling. 132
upgrade 131
know, 131
P@@ 131
describing 131
hiding 131
diet 131
trust 131
but, 131
records? 131
medications... 131
Jaye 131
factors' 131
variation. 131
jenny@healintcom? 131
Charlotte, 131
discuss. 131
overlap 131
developing 130
items. 130
events, 130
!!! 130
4. 130
explanatory 130
anytime. 130
button) 130
concerned 130
listen. 130
drag 130
hell 130
frequently. 130
only. 130
Liliana, 130
Hey 129
called 129
Sense 129
shouldnt 129
knows?? 129
understand/solve 129
emailed 129
phones, 129
problematic 129
annoyed 129
"problem 129
server" 129
log... 129
Keree! 129
greatly 128
yours 128
load 128
version. 128
eork 128
Eileen. 128
receiving 128
amazing....only 128
Kiki, 128
"Triptan 128
100mg 128
wished. 128
Displayed 128
proceed. 128
Rarely 128
I'll 127
thinking 127
migraine! 127
personal 127
luck 127
started. 127
(not 127
moment. 127
multi 127
stars? 127
open. 127
Add 127
Oct 127
Margaret, 127
reminder 126
not! 126
company 126
light 126
changes. 126
accounts 126
samsung 126
phones. 126
Any 126
priority 126
Deleting 126
AGAIN, 126
Cinease, 126
try? 126
attention 125
email, 125
news 125
track. 125
organized 125
star! 125
choose 125
nor 125
slept 125
model 125
okay 125
18. 124
running 124
Normally 124
versions 124
Haley, 124
network) 124
Nabila, 124
ice 123
.. 123
G@@ 123
welcome 123
stuff 123
matching 123
By 123
extra 123
lot! 123
"sleep 123
after. 123
html. 123
agreed 123
sell 123
script 123
parse 123
fraction 123
disappointing. 123
grabbing 123
Wendee, 123
that.Please 123
immediatly 123
while, 123
7.1 123
corrected 123
17, 123
updgraded 123
generic 123
Keith 123
Currently 122
Amazing 122
despite 122
itself 122
hrs 122
Nov 122
AppController 122
repetitively 122
document 121
for. 121
guess 121
everyday 121
"Pain 121
onset" 121
here. 121
previous 121
yesterday's 121
Ila, 121
synchronization 121
draining 121
A7 121
Arash, 121
shortly. 121
3. 121
today, 121
reasonably 121
dismiss. 121
displaying 121
excessively 121
apologises 121
before. 120
super 120
call 120
wanted 120
;) 120
j@@ 120
More 120
reasonable 120
name. 120
needed? 120
https://play.google.com/store/apps/details?id=com.healint.migraineapp 120
expectations. 119
small 119
executed. 119
Alyssa, 119
otherwise. 119
Maryana, 119
forever. 119
quit 119
sipper 119
happening 118
necessary 118
moving 118
suffered 118
Those 118
initially 118
Completely 118
indefinitely, 118
Charity, 118
away- 118
w@@ 117
team! 117
develop 117
Having 117
YOU 117
list" 117
reliability. 117
become 116
total 116
es, 116
understanding 116
Or 116
3-4% 116
consumes 116
verification 116
paste 116
tech 115
...@@ 115
analysis. 115
automatically. 115
Larissa, 115
focus 114
pressure. 114
prevent 114
asleep 114
Turn 114
"Set 114
following: 114
mode! 114
h.a. 114
at@@ 113
di@@ 113
course 113
confused 113
future. 113
Where 113
screwed 113
Swipe 113
tracking" 113
"doesn't 113
migraines"? 113
women, 113
direction, 113
well, 112
"attack 112
as@@ 112
choices 112
kinda 112
5* 112
Am 112
me: 112
Excellent 111
el@@ 111
). 111
lots 111
useful! 111
print 111
quality 111
complex 111
Other 111
right-hand 111
eat 111
GPS 111
ar@@ 110
i'll 110
profile 110
Given 110
score! 110
response 110
Talk 110
yes, 110
mess 110
weather, 109
ac@@ 109
stops 109
know. 109
calculation 109
primary 109
reported- 109
long? 109
hit? 109
afterthought. 109
anymore- 109
They 108
migraine-free 108
recently 108
saving 108
efficient 108
Tracking 108
reading 108
progress 108
Chronic 108
apologies 108
input. 107
t. 107
collect 107
away. 107
particularly 107
appreciated 107
hasn't 107
cloud 107
Adam, 107
frustration 107
Are 107
seeing 106
recognize 106
Me 106
bother 106
require 106
Increasingly 106
Friday 106
Jane, 106
Angel, 106
With 105
AM 105
provided 105
Record 105
believe 105
methods 105
observations 105
general 105
information! 105
MY 105
loving 105
why? 105
Update 104
us@@ 104
custom 104
ra@@ 104
ed, 104
Sadly 104
O@@ 104
used. 104
J. 104
nearly 104
Angel. 104
off, 104
(Samsung 104
disappointment? 104
I@@ 103
Well 103
triggers! 103
compatible 103
consider 103
per 103
vestibular 103
appear. 103
upon 103
thus 103
extreme 103
Veronica 103
F@@ 102
8 102
becomes 102
person 102
suffering 102
th@@ 102
z@@ 102
year 102
developed 102
bring 102
enough. 102
now"button 102
right! 102
deactivated 102
rating, 102
support@healint.com, 102
intake, 102
sharp 102
follow 101
ing, 101
am@@ 101
change, 101
That 101
chart 101
newer 101
app... 101
difference 101
solutions 101
recordings 101
working, 101
security 101
cases 101
returns 101
(3 101
acurately 101
acutely 101
Tells 101
breakage 101
misleading 101
doctor/neurologist. 101
Kept 101
Uninstalled. 101
Makes 100
Highly 100
medications, 100
feels 100
status 100
creation 100
3* 100
"Bother 100
strange 100
activated 100
Christel, 100
ease 99
up. 99
terrible 99
strongly 99
brain 99
es@@ 99
intensity. 99
jenny@healint.com, 99
run 99
finish 99
playing 99
round. 99
blocked, 99
cases. 99
wheel 99
you: 99
words. 98
Al@@ 98
terms 98
addition 98
N@@ 98
Useful 98
regarding 98
discovered 98
pick 98
Nicole! 98
bc 98
stopping. 98
reinstalled 98
elsewhere. 98
need! 98
info? 98
immediately! 98
crash/loss. 98
ly 97
together 97
watch 97
An@@ 97
doctors. 97
clearly 97
perfectly. 97
home 97
Back 97
Later" 97
S5, 97
notices 97
intensity, 96
he 96
pushy 96
notifications. 96
button. 96
ups 96
avail. 96
varies 96
Headaches 96
Let's 96
default, 96
apps. 95
Christine, 95
done. 95
assess 95
news. 95
background. 95
Alexandra. 95
You're 95
clicking 95
patience 95
support@healint.com. 95
spinning 95
Katherine, 95
Saulat 95
Gwen, 95
auto-detect 95
90% 95
detect. 95
alvays 95
chek 95
Ieva, 95
fails 95
V@@ 94
hate 94
Wasn't 94
Disappointing 94
kindergarten 94
bad! 94
Allaina, 94
4.1 94
plans 94
suggestion. 94
stack 94
ill 94
me? 94
notification. 94
out? 94
one? 94
job 93
side 93
Without 93
proper 93
Amanda. 93
forgotten 93
These 93
lasting 93
another, 93
unbearable. 93
Leko, 93
unfair 93
beat 93
willing 93
myself, 93
Kathryn, 93
field, 93
dog 93
im@@ 92
menstruation 92
al 92
live 92
enable 92
Tara, 92
increase 92
wants 92
suggestions, 92
searching 92
icon. 92
OK. 92
Jo@@ 91
app@@ 91
humidity 91
Sh@@ 91
cool 91
menstrual 91
open, 91
paid 91
identified 91
eats 91
myself. 91
months, 91
recommending 91
1* 91
careful 91
18th 91
not. 91
medicines 91
Installed 91
rendering 91
rating- 91
resolved? 91
er. 90
Fitbit 90
deleting 90
tracker, 90
ahead! 90
collecting 90
kills 90
types, 90
answering 90
Daily 90
flat 90
immediately. 90
improve, 90
blocking 90
Aug. 90
time" 90
Docs 90
match/invalid. 90
mins 90
pig 90
elusive 90
assistance: 90
negative 89
li@@ 89
ad@@ 89
straight 89
wanting 89
doctors, 89
trigger. 89
drained 89
Seems 89
reply 89
changes, 89
smoothly. 89
Same 89
drug. 89
urgently 89
Crashed 89
sickening 89
"free 89
bs. 89
head; 89
*post 89
coma,concussions 89
blunt 89
trauma~ 89
Guinea 89
af.uninstall. 89
Jocelyn, 89
will. 88
friend 88
correlation 88
potential, 88
3, 88
language 88
ON 88
friendly! 88
talking 88
Here 88
blog 88
either 88
What's 88
participate 88
counts. 88
'automatic 88
detector' 88
Remark 88
here's 88
contact@healint.com. 88
Hate 88
register. 88
Rude, 88
noted, 88
privilege 88
safety 88
risk, 88
protection. 88
invalid 88
condition. 87
ones 87
various 87
connected 87
happy. 87
folks 87
thanks. 87
fairly 87
weird 87
conditions 87
read. 87
shown 87
direct 87
worried 87
detail, 87
me.. 87
disabling 87
Shame 87
awful. 87
disgusted 87
programmer 87
analyst, 87
peer. 87
navigation 87
exhausting, 87
atrocious. 87
inserted 87
Dear, 87
area: 87
97% 87
refuses 87
you- 87
Crashes 87
28: 87
سلام 87
شبنم 87
ما 87
مایل 87
کمک 87
بیماران 87
میگرنی 87
سراسر 87
جهان 87
طریق 87
برنامه 87
و 87
امیدواریم 87
که 87
چندین 87
مختلف 87
است. 87
این 87
اما 87
شما 87
می 87
توانید 87
انگلیسی 87
استفاده 87
فارسی 87
نیست. 87
با 87
تشکر 87
درک 87
خود 87
تو 87
خوبی! 87
signing 86
Awesome 86
place! 86
handle 86
family 86
privacy 86
finally 86
strive 86
dose 86
Perfect 86
know! 86
five 86
Katie, 86
Downloaded 86
lil 86
=( 86
needed! 86
registered 86
adjusted 86
disable 86
company. 86
back- 86
ers 85
things: 85
Otherwise 85
couldnt 85
is@@ 85
future 85
imagine 85
continues 85
community, 85
Alice, 85
:/ 85
JUST 85
recurring 85
required 85
sold 85
language. 85
hr. 85
2014 85
helping! 85
Didnt 85
together? 85
ایران 85
کار 85
نمیکنه 85
Zoheb, 85
low? 85
Jude, 85
effort 84
Overall 84
having. 84
condition 84
hesitate 84
il@@ 84
ways 84
went 84
recommends 84
begin 84
crazy 84
again, 84
regret 84
convenient. 84
consumer 84
Jaime. 84
Regarding 84
adjust. 84
deeply 84
stage. 84
joke 84
waste 84
guesses 84
Laurie, 84
intention 84
itself. 84
forum 84
research, 84
Sent 84
stupid. 84
WASTE 84
SPACE 84
PHONE 84
SAYING!!!! 84
Lynnette, 84
si@@ 83
's 83
t, 83
friendly" 83
ation 83
totally 83
reporting 83
update! 83
pictograms 83
Wouldn't 83
continually 83
Dont 83
data.It's 83
troubleshoot 83
costs 83
Send 83
temporary 83
raising 83
doctor? 83
frustration. 83
gimme 83
demo. 83
lay 83
head?? 83
rply 83
Momika, 83
http://goo.gl/tbkqDM 83
http://goo.gl/10t05Q 83
desperation 83
locked. 83
reading, 83
CS 83
crap... 83
agony 83
inconvenienced. 83
account- 83
with? 83
intended). 83
anti-medication. 83
prescriptions 83
pushes 83
Meg, 83
newsletter. 83
NEVER 83
sells 83
data: 83
anonymized 83
aggregated. 83
Bálint, 83
firgure 83
3-5%. 83
Mar@@ 82
Facebook, 82
a!! 82
hand 82
use! 82
'my 82
easiest 82
helpful, 82
or@@ 82
ed@@ 82
perfect. 82
list. 82
days, 82
special 82
Abusing 82
audio 82
ads? 82
Terrible. 82
Josh, 82
Being 82
Sharon, 82
Jan! 82
Junk!!!! 82
inflamed 82
hemorrhoids! 82
nightmare, 82
interuptions! 82
unsatisfactory 82
ones. 82
"fixes". 82
joy. 82
Appt 82
deployment 82
disconnected 82
suppose. 82
deepest 82
apologies. 82
urgently. 82
sugar", 82
Suffering 82
promote 82
problems? 82
arguments 82
blame 82
mockable 82
bulliable 82
misslead 82
believing 82
neglected 82
innocenceฯ 82
Nope! 82
ancient 82
spent...Maybe 82
wickipedia 82
work.. 82
'buy' 82
disposable 82
cell! 82
*50 82
meg 82
bloats 82
usable.* 82
investigation 82
developers: 82
breach 82
Removed 82
spaming 82
Methods 82
Google, 81
swirls 81
"Synchronisation" 81
Shawna, 81
Play: 81
five-star 81
experience: 81
developer 81
tracking, 81
ir@@ 81
opinion 81
professional 81
Overall, 81
charting 81
care! 81
mobile 81
"overlapping" 81
aren't. 81
Rachell, 81
Lynn, 81
Internet 81
Lorna, 81
responding, 81
constructive 81
1671 81
background 81
invitation 81
Looked 81
misdiagnosis 81
(19++MB) 81
succeed 81
m 80
care 80
Tony, 80
tend 80
aura 80
dates 80
wishing 80
hour 80
integrated 80
before! 80
removing 80
Bad 80
facing? 80
(minus 80
Nowhere 80
Henry, 80
section? 79
associated 79
suffers 79
on, 79
bright 79
one-star 79
doc 79
setup 79
active 79
wasn't 79
free. 79
Took 79
app; 79
migrains 79
Migrain 79
92 79
and, 79
addition, 79
mentioning 79
detection, 79
Sucks! 79
Freezes 79
Swiping 79
accross 79
nothing. 79
(e.g. 79
3/5. 79
DOWNLOAD 79
UNLESS 79
CODE 79
disapointed. 79
away-unfortunately 79
launch 79
it-the 79
Mo, 79
Hazel, 79
perhaps, 79
Jae, 79
activate 78
Lots 78
tough 78
support, 78
ri@@ 78
ic@@ 78
buddies'. 78
COOL. 78
Jacqueline, 78
said 78
control 78
updates. 78
Jenny! 78
gone 78
wonderful. 78
with. 78
sorted 78
tuning 78
correcting 78
STILL 78
(chat 78
faster). 78
developer. 78
access. 78
independently 78
consumed 78
212Mb 78
network!! 78
consume 78
insane. 78
Pedro, 78
true, 78
correct! 78
Android! 78
happen) 78
😕 78
progressively. 78
Vaibhav, 78
Hi. 78
strictly 78
private 78
confidential 78
studies. 78
change/reset 78
Ady, 78
experiencing? 78
tremendous 77
patterns, 77
d, 77
encouragement. 77
suggestions. 77
evaluation 77
spot 77
wish, 77
consistently 77
wished 77
once, 77
with), 77
WiFi 77
sync. 77
Waste 77
later, 77
improved? 77
drink 77
extensively 77
attempted 77
unbiased, 77
review/critique 77
perspective, 77
criticism 77
business 77
approach, 77
(hence 77
sent) 77
criticisms. 77
Mike, 77
e-mail, 77
Donnel, 77
Cassandra, 77
code, 77
Emksa, 77
impressed 76
basic 76
diary. 76
calendar. 76
report. 76
ent 76
Recent 76
handy 76
occur 76
line 76
9 76
ons 76
awesome! 76
experience? 76
noted 76
migraine). 76
automated 76
ir 76
NO 76
position 76
improvements, 76
opening/syncing, 76
irretrievably 76
responding. 76
together... 76
lost! 76
followed 76
kids 76
rest. 76
charts! 76
errors, 76
syncs, 76
other?! 76
wasted 76
inconvenience! 76
erase 76
Komal, 76
24h! 76
easier. 75
de 75
headache. 75
ent@@ 75
reports, 75
d. 75
insights 75
intrusive 75
issues. 75
activities 75
co@@ 75
entries. 75
want, 75
first, 75
actions 75
third 75
loses 75
Hoping 75
(^_^) 75
agree 75
fee, 75
net 75
human 75
those. 75
occur! 75
Jason, 75
WISH 75
YET 75
TWICE 75
better; 74
putting 74
delighted 74
dates, 74
match 74
Time 74
source 74
Jessie, 74
W, 74
also. 74
typical 74
Recording 74
works, 74
felt 74
charged. 74
charged 74
Sammie, 74
requiring 74
Mira, 74
suggestion? 74
3:26am 74
popping 74
Assumes 74
unrealistically 74
reality. 74
*don't* 74
heavily 74
biased 74
coffee 74
99.9% 74
esp. 74
Destroys 74
foreground 74
Requires 74
bias 74
please! 74
offline 74
reviewed 74
Nic, 74
likely 73
instant 73
me@@ 73
That's 73
U@@ 73
example, 73
individual 73
Works 73
migranes 73
here, 73
solution! 73
online. 73
Tell 73
wrote 73
exchanging 73
Horrible. 73
clicked 73
mock-entry. 73
"overlapped" 73
fake, 73
Dominique, 73
synchronizing:( 73
Lee, 73
allocate 73
ti@@ 72
dis@@ 72
great! 72
turned 72
; 72
myself 72
ended 72
Migraine. 72
steps 72
everything, 72
interesting 72
impact 72
Lost 72
mostly 72
questions, 72
Olivia, 72
ends. 72
problems, 72
decrease 72
amazing, 72
stored 72
You'll 72
reviews, 72
Crystal, 72
Kathy, 72
giv 72
Nabz, 72
Account 72
hundreds 72
encrypted. 72
logs, 72
Amy. 71
d 71
End 71
Confusing. 71
Deleted. 71
gone, 71
start/ 71
ideas. 71
William, 71
theme 71
Uses 71
quickly. 71
disappointment. 71
big-brother. 71
slept, 71
harassed 71
proportion 71
default. 71
settings, 71
worry. 71
food, 70
benefit 70
W@@ 70
trends 70
thing. 70
lo@@ 70
appointments. 70
Loved 70
Because 70
Edit: 70
tr@@ 70
deeper 70
effectively 70
Samantha, 70
Irritating 70
frozen 70
M.L. 70
V., 70
Play). 70
Weather 70
settings? 70
launched 70
moment, 70
entre 70
entre. 70
Kiara, 70
done 69
gain 69
Haven't 69
consuming 69
ap@@ 69
On 69
indeed 69
Rebecca, 69
located 69
widget 69
mark 69
Made 69
hand. 69
none 69
doses, 69
Nice. 69
cut 69
fine, 69
Tanikca, 69
lowering 69
Best, 69
setting 68
do. 68
us, 68
interface. 68
parts 68
ts 68
decided 68
effectiveness 68
analyse 68
ends 68
job. 68
layout 68
Help 68
course, 68
tad 68
dodgy. 68
hogs. 68
Another 68
offline. 68
note! 68
mistake? 68
http://goo.gl/@@ 68
aware 67
x@@ 67
nice. 67
reliefs, 67
level, 67
off. 67
preventing 67
thanks! 67
listed 67
encouragement 67
tried. 67
tracking? 67
B.S.! 67
ended! 67
decompression 67
surgery! 67
Miranda, 67
face, 67
underlined 67
"B.S." 67
highlighted 67
fuss 67
dramatically 67
wrong! 67
Annie 67
backing 67
severe, 67
unnecessary 67
verifying 67
Gabby, 67
protected, 67
nobody 67
impersonate 67
unlocking. 67
http://migrainebuddy.uservoice.com/forums/253148-leave-feedback 67
results 66
sp@@ 66
stress 66
cluster 66
k 66
reliable 66
compare 66
help, 66
hard-working 66
notes. 66
do@@ 66
progression 66
While 66
Think 66
elements 66
useful, 66
hrs. 66
insomnia 66
eaten 66
functions. 66
thoughts. 66
(sometimes 66
flaws. 66
Cant 66
freely 66
Stupidest 66
,@@ 65
fitbit 65
customized 65
filter 65
mentioned 65
Was 65
experiencing 65
1@@ 65
developers. 65
prefer 65
produce 65
page, 65
critical 65
migrane 65
format. 65
yesterday 65
shift 65
36 65
Beth. 65
Nicki, 65
self-explanatory 65
moral 65
worries- 65
Feedback 65
Unaware 65
acesss 65
hoping 64
user-friendly 64
determine 64
efforts 64
Doctor. 64
evaluate 64
jot 64
sections 64
Karen, 64
(if 64
initial 64
head, 64
ovulation 64
periods. 64
Headache 64
start/end 64
level. 64
power. 64
Possibly 64
up! 64
size 64
ex: 64
Tab1", 64
Tab2". 64
soon) 64
ID? 64
detects 63
ations 63
hours. 63
ing@@ 63
activities, 63
experiences. 63
Denise! 63
view 63
remaining 63
split 63
appointment! 63
Meanwhile, 63
diagnostic 63
all@@ 63
represents 63
perhaps 63
expect 63
fun 63
though! 63
detecting 63
adjustments. 63
start/stop 63
"edit" 63
sleep....the 63
back!! 63
Anyone 63
four 63
servers 63
Suzanne, 63
8% 63
Samreen, 63
signalled 63
Samsung). 63
Micheala. 63
on! 62
pl@@ 62
they've 62
liking 62
sufferer, 62
Extremely 62
pay 62
points 62
ver@@ 62
like, 62
reminding 62
Contact 62
stroke 62
clock 62
ways. 62
mail 62
plenty 62
better, 62
Attack 62
Neuro 62
wonder 62
and/or 62
&gt;.&lt; 62
(with 62
ouch, 62
signed 62
improve. 62
3-5% 62
useless. 62
prototypes. 62
..but 62
bummed 62
Laura,after 62
constant, 62
included 61
mode. 61
methods, 61
honestly 61
buttons 61
l 61
neurologists 61
methods. 61
4@@ 61
en! 61
Garmin 61
comments. 61
Hemiplegic 61
slowly..most 61
justifies 61
3*? 61
improvement. 61
categories. 61
stuck 61
compliments. 61
lessen 61
unlikely 61
variation, 61
added, 61
air 60
hurt 60
". 60
doctor's 60
enhance 60
separately. 60
stages 60
plus 60
timer 60
11 60
disrupted 60
MyFitnessPal 60
pass 60
transfer 60
FREE 60
poor 60
food. 60
occasionally 60
soon! 60
help? 60
popular 60
dry. 60
ok. 60
en. 59
later. 59
Th@@ 59
ha@@ 59
Kate. 59
blank 59
godsend 59
description 59
Symptoms, 59
value 59
ea@@ 59
happens. 59
ab@@ 59
regularly 59
ol@@ 59
navigate 59
MigraineBuddy. 59
Rachel, 59
completely 59
earlier 59
implementing 59
integrating 59
warnings 59
Migraines, 59
neurology 59
tag 59
differentiate 59
P, 59
14 59
screenshots 59
lost. 59
triptan 59
increased 59
stable, 59
Syndrome 59
regards 58
cl@@ 58
pro 58
e!! 58
updates, 58
her. 58
people. 58
row 58
Been 58
wear 58
Something 58
dose. 58
Cannot 58
exporting 58
discussing 58
picker 58
simple, 58
possibility 58
icons, 58
year! 58
too). 58
Liz. 58
daughter. 58
:). 58
annoying, 58
Often 58
better? 58
Marian, 58
started? 58
access, 58
signal. 58
these... 58
Susannah, 58
someone's 58
evade 58
punish 58
&gt;д&lt;). 58
(support@healint.com) 58
aspects 57
Jen, 57
brilliant 57
em@@ 57
er, 57
tab 57
relying 57
le 57
list 57
Etc. 57
pro@@ 57
calendar, 57
pushing 57
Apart 57
27 57
Connnect 57
FroggyWare's 57
Diary 57
Manually 57
inserting 57
migraina 57
horrible. 57
function? 57
import, 57
drome. 57
13 57
chats. 57
color 57
visually 57
familial 57
exhibit 57
Tanya, 57
Two 57
add/remove 57
recording, 57
to: 57
Joy, 57
normally. 57
painful! 57
Maxwell! 57
vague 57
slows 57
"incomplete" 57
traditionally 57
4h 57
72h, 57
longer, 57
ramps 57
extends 57
breakthrough 57
min. 57
Meds 57
fantastic 56
biggest 56
MB 56
ig@@ 56
Car@@ 56
effective 56
dropping 56
OS 56
monitor. 56
i! 56
5th 56
above 56
sleep? 56
ting 56
request 56
yourself 56
Kellie. 56
average. 56
Unfortunately, 56
began. 56
White 56
= 56
Jay, 56
fingers 56
crossed 56
mid 56
Joanne. 56
(as 56
Things 56
Storing 56
keeping​ 56
migraines...so 56
its​ 56
Jodi-Ann. 56
properly, 56
correct... 56
be? 56
screenrecord 56
Mobizen 56
else) 56
updating! 56
patten 56
functions, 56
sync-ed 56
16.6. 56
randomly 56
can't. 56
Shlemyith! 56
Jenny@healin.com 56
app.....so 56
indicative 56
stars) 56
fast! 56
migraine-buddy. 56
perfect!! 56
Mirea! 56
Mirea, 56
stuck. 56
considerable 56
com@@ 55
EDIT: 55
ation. 55
realize 55
mo@@ 55
p 55
ve 55
Krist@@ 55
Fantastic 55
too! 55
confirmed 55
sufferers.:-) 55
matter 55
struggling 55
silly 55
Diane, 55
upset 55
migraines- 55
locations 55
buddy, 55
score. 55
Claire, 55
delete. 55
job, 55
Journal 55
summary. 55
Doesn't 55
unusable. 55
Stephen, 55
thoughts/suggestions 55
reliable. 55
29 55
September... 55
clarification, 55
plan, 55
Lucy, 55
hurt, 55
moves, 55
up/fall 55
becky, 55
repeated. 55
soliciting 55
shortcomings. 55
vague. 55
Migraine-Buddy. 55
erasing 55
Regina, 55
reinstalling 54
Y@@ 54
i. 54
ch@@ 54
sleeping. 54
est 54
interface, 54
incredibly 54
confusing. 54
often. 54
user, 54
OK 54
(I'm 54
entered 54
wears 54
feel. 54
A5) 54
to). 54
Notification 54
slide 54
A5 54
100 54
leaving 54
date, 54
Ashley, 54
Fatima, 54
further, 54
facebook! 54
Kimberley, 54
Bug 54
4% 54
1671, 54
Until 54
worries, 54
depending 54
deleted, 54
altered 54
Icarus, 54
continuously, 54
throbbing, 54
migraines...I 54
26th 54
27th 54
instead..won't 54
crack 54
case). 54
Google-play 54
me!!! 54
Sarah! 53
LOVE 53
Brilliant 53
long, 53
lets 53
appointment 53
https://youtu.be/k-hf8MyBnbE 53
you@@ 53
motivate 53
3rd 53
hours, 53
piercing 53
harder 53
logs. 53
reasons 53
right? 53
developers, 53
tools 53
following 53
cluster, 53
doc. 53
processed 53
easier, 53
first. 53
Dana, 53
type". 53
referring 53
providing 53
KEEP 53
UP 53
Angela, 53
anywhere, 53
Jenny@healin.com? 53
amount, 53
Janessa, 53
complexity. 53
convince 53
relate 53
improvement? 53
clinicians. 53
Jan@@ 52
ul@@ 52
symptom 52
fitness 52
smart 52
de@@ 52
contains 52
help@@ 52
auras 52
headaches/migraines 52
en 52
capability. 52
se@@ 52
"no 52
buddies 52
hits 52
ec@@ 52
excel 52
solid 52
woke 52
using, 52
opening 52
Prior 52
Updated 52
something, 52
experienced 52
added. 52
alcohol 52
sk 52
4.5 52
5) 52
forthcoming 52
review: 52
operate 52
suport 52
Lynsey, 52
versions. 52
Wanted 52
postdrome. 52
High 52
correspond 52
(Ie 52
sleep) 52
goto 52
short, 52
(20mn 52
max). 52
reason. 52
pains.. 52
usles 52
influence. 52
Adriana, 52
enthusiasm. 52
Original: 52
tiers 52
bugging, 52
overpriced, 52
inferior 52
alternatives. 52
opposite. 52
mechanism. 52
codes 52
non-clinician 52
hop 52
dr 51
service. 51
suggests 51
2) 51
bo@@ 51
to@@ 51
ag@@ 51
hard. 51
Buddy! 51
aw@@ 51
exists 51
let's 51
prevents 51
Isabella, 51
s? 51
https://migrainefoodcoaching.squarespace.com/ 51
Jeff, 51
note. 51
unusual 51
daith 51
Daith 51
occurs. 51
interrupted 51
integration 51
type" 51
heres 51
(it's 51
eyes) 51
Buddy? 51
Removing 51
being, 51
insists 51
gradually 51
forced 51
Personally 51
😣 51
caffine, 51
Theres 51
bug) 51
we&#39;d 51
Rhiannon! 51
meds/relief 51
Shawn, 51
characters 51
(francois@healint.com) 51
(midnight) 51
minus 51
hours??? 51
Confuses 51
Kat, 51
entering. 51
developer's 51
below, 51
rush 51
Lol). 51
motivations 51
(^_^). 51
google-play's 51
Regular 51
Temps 51
Humidty. 51
registration 51
Burak, 51
Access 51
con@@ 50
late 50
ful 50
1) 50
built 50
r 50
ar 50
monitoring 50
about. 50
microsd, 50
exteral 50
bacup 50
moved, 50
hartrate, 50
sleeppattern 50
Sport 50
too, 50
(top 50
Michelle! 50
Kate, 50
Nichelle, 50
needs? 50
su@@ 50
VM 50
glitchy 50
represent 50
Jerry, 50
Piercing 50
inside 50
end... 50
bar? 50
Michaela, 50
subscription 50
healint 50
proves 50
travel 50
Kirsty, 50
typed 50
10/31/16 50
Desk 50
night's 50
Lowering 50
retrieving 50
Jessie! 50
Cool 50
fixed. 50
verified 50
Concept 50
Nichole, 50
behaviour 50
(｡◠‿◠｡) 50
Facebook/Google 50
addresses 50
method/email? 50
doctor! 49
c 49
them, 49
replied 49
failed 49
tension 49
ing! 49
affecting 49
er! 49
him 49
!@@ 49
communicating 49
Tammy. 49
sensors 49
minutes. 49
day,a 49
weeks,with 49
day,when 49
level,the 49
intensity/location/symptoms. 49
menu&gt;export 49
recover 49
coaching 49
"Notes" 49
convenient! 49
buy 49
disappeared. 49
works! 49
2nd 49
migranes? 49
dizzines 49
(similar 49
sickness) 49
sickness 49
occaisional 49
fainting. 49
"vestibular"button. 49
basics 49
screen). 49
somewhere 49
wake! 49
使い易くデザインも良いですが、入力する際に毎回同期を行うのが煩わしいのと、Webから過去の入力データを閲覧可能にしてほしい。 49
magically. 49
Darlene, 49
http://goo.gl/0fMsLl 49
Craig, 49
reports.Could 49
resend 49
Chesh, 49
17 48
strong 48
tim@@ 48
dat@@ 48
min@@ 48
king 48
amazing. 48
7@@ 48
vi@@ 48
ds 48
ly. 48
al. 48
functional 48
Definitely 48
pain@@ 48
Ch@@ 48
program. 48
shame. 48
unreliable. 48
future, 48
seconds 48
ly, 48
anything, 48
Valerie! 48
cycles 48
Design 48
details! 48
instructions. 48
anywhere 48
unusual, 48
clinic 48
"loading," 48
habits- 48
vitamins 48
Amina, 48
Yes... 48
mistakes. 48
verry 48
insterested 48
experience! 48
continuously. 48
Gayle, 48
S4). 48
bug? 48
thingy 48
Mayo 48
margaux, 48
Show 48
soon!! 47
Besides 47
Medical 47
w 47
(in 47
calender 47
moved 47
and@@ 47
worse. 47
Bonnie. 47
Food 47
types. 47
this: 47
Auras 47
secure 47
Michael, 47
Veronica. 47
efficiently. 47
oranges 47
Stopped 47
unresponsive 47
frustrating, 47
Paul 47
idea. 47
chat: 47
Update, 47
UX. 47
older 47
Mz 47
Lady, 47
uncommon, 47
away! 47
Kenneth, 47
drains 47
pains 47
Navanit, 47
comparison: 47
right.) 47
O.T.T 47
dissatisfied 47
Joey, 47
alot 46
um@@ 46
ill@@ 46
tool. 46
t! 46
ie! 46
St@@ 46
friends 46
knew 46
ou@@ 46
..@@ 46
community 46
area 46
mine 46
foods, 46
ine 46
an! 46
prompts 46
ks 46
life. 46
"a 46
related, 46
realised 46
breakdown 46
Kiah, 46
three-star 46
reflects 46
everyday) 46
assisting 46
variable 46
efforts! 46
NB: 46
week) 46
3) 46
buggy 46
forget, 46
sleeping! 46
shortly 46
posting 46
Darcie, 46
Darcie!! 46
Warm 46
ere@@ 45
relief. 45
Tracks 45
th 45
In@@ 45
ding 45
Jessica! 45
use@@ 45
permanent 45
Ro@@ 45
5@@ 45
journal. 45
selected 45
measure 45
Instead, 45
Dawn, 45
sleep" 45
drank 45
wife 45
these. 45
outdated...Requires 45
Avi. 45
state-of-the-art 45
Besides, 45
protection 45
confidentiality 45
seriously: 45
Joelle, 45
appstore. 45
Lets 45
crashing? 45
dislike 45
prefer, 45
engaging 45
[Update] 45
intake. 45
search, 45
(within 45
S4 45
detect, 45
Jennilynn, 45
S4, 45
Unless 45
(S4 45
old), 45
software/option 45
usability. 45
migraines.....but 45
sudden, 45
singular 45
warning, 45
"thunderclap 45
headache": 45
http://goo.gl/iYCR4K 45
Diagnostic). 45
http://goo.gl/fWcAjL 45
You'd 45
3-star 45
deflated 45
ur@@ 44
ise 44
details. 44
treatments 44
Jennifer! 44
are. 44
age 44
app!! 44
decreasing 44
start@@ 44
concrete 44
Keri, 44
question. 44
words! 44
24/7. 44
Confusing 44
taken. 44
Nancy, 44
play.Please 44
HI 44
corner) 44
"My 44
schemes 44
Channel 44
alerts... 44
tree 44
grass 44
weed. 44
substantial 44
answer. 44
Interphase 44
unusable 44
"bugs"? 44
plz 44
waking 44
zephyr, 44
Jim, 44
properly- 44
school, 44
painful. 44
Dera 44
access.  44
abosulety 44
purposes. 44
▶ 44
quoted 44
Imrose, 44
Operating 44
System 44
incompatible 44
SSL 44
transferring 44
resolves 44
Switched 44
unchanged. 44
Exame: 44
11pm, 44
6am. 44
Uninstalled/reinstalled 44
"quality 44
metric, 44
Grin, 44
http://goo.gl/EdmBVC, 44
good.....it 44
WAS 44
2-4% 44
go@@ 43
ex@@ 43
ho@@ 43
2@@ 43
be@@ 43
an. 43
his 43
id@@ 43
ity 43
designed. 43
intuitive 43
...but 43
...the 43
burst 43
add@@ 43
list@@ 43
implement 43
jenny@healint 43
bar 43
ev@@ 43
preference. 43
Tiffany, 43
6:12 43
feedback.Feel 43
fee 43
adapting 43
vary. 43
highest. 43
(eg 43
12h) 43
Rosanna, 43
functionality! 43
Jo!! 43
iphone 43
overide 43
Ime, 43
ne@@ 42
en, 42
ago. 42
misses 42
ai@@ 42
program 42
work@@ 42
sensitive 42
tracked 42
h 42
Few 42
Zachary, 42
end@@ 42
depth 42
so@@ 42
ma@@ 42
left/right/centre. 42
above, 42
positions 42
triggering 42
triggers? 42
teach 42
Abigail, 42
Kiley, 42
tired 42
Vicki, 42
purpose, 42
manipulate 42
talk! 42
Nicely 42
Missy, 42
humbly 42
disappointment, 42
terribly 42
so? 42
3-5 42
backlog. 42
Asdulla, 42
there..I 42
migraine...I 42
code..how 42
Lynie, 42
switching 42
iphone. 42
plan 41
De@@ 41
reliefs. 41
factors 41
Amanda! 41
), 41
some@@ 41
for@@ 41
au@@ 41
detailed. 41
awesome. 41
Absolutely 41
work!!! 41
Helped 41
you!! 41
graphics, 41
(mine 41
device? 41
BUT, 41
gmail 41
"I 41
Hasn't 41
sugar 41
Krista, 41
"some 41
sugar" 41
phone... 41
Thomas, 41
loading. 41
meanwhile 41
triggers...but 41
Kaleisy, 41
star@@ 40
' 40
s/@@ 40
no@@ 40
gi@@ 40
!!!! 40
UX 40
ous 40
things. 40
oo@@ 40
covers 40
forgetting 40
k, 40
adaptable 40
notifications, 40
learned 40
et@@ 40
Triggers" 40
ble 40
holding 40
hurts. 40
star) 40
star). 40
FRUSTRATED. 40
*****davis@gmail.com. 40
inaccurate 40
9/19/16* 40
anymore.* 40
extra, 40
center 40
that!) 40
[Edit: 40
Again 40
minute 39
miss 39
tion 39
bl@@ 39
picture 39
ee@@ 39
report@@ 39
Ann@@ 39
9@@ 39
touching 39
ge 39
m. 39
fac@@ 39
ted 39
ratings 39
encourages 39
tracks. 39
themselves 39
set? 39
individually 39
update? 39
detected? 39
Notifications 39
crazy. 39
happened, 39
issues: 39
milliseconds 39
"synchronizing" 39
"loading" 39
Shelley, 39
time..! 39
55% 39
10:00. 39
Vincent, 39
Glaxy 39
exactly. 39
res@@ 38
Neurologist 38
ve. 38
have. 38
written 38
ari@@ 38
Wow, 38
pattern. 38
duration, 38
fit 38
man@@ 38
Much 38
Christ@@ 38
ran@@ 38
foe 38
45 38
straight, 38
roll 38
nicw 38
notified 38
posted 38
(daily 38
weekly) 38
email? 38
interruption, 38
remember, 38
pls 38
requests. 38
Wow 37
Tr@@ 37
ent. 37
wh@@ 37
k. 37
se 37
are@@ 37
ed! 37
rel@@ 37
ic 37
S 37
du@@ 37
sleep@@ 37
star, 37
clear 37
treatment! 37
iti@@ 37
ahead 37
ep@@ 37
ur 37
re 37
Mari@@ 37
Simple 37
ally 37
intervals, 37
awake. 37
el! 37
darken 37
star- 37
eaten. 37
Denise, 37
"Leave 37
Feedback" 37
Suggestion". 37
(Francois@healint.com) 37
ve, 36
recommend. 36
weather. 36
communication 36
Z@@ 36
preventative 36
discover 36
d! 36
ro@@ 36
screens. 36
ie, 36
stop. 36
Yes 36
time@@ 36
motivates 36
9pm 36
3:27 36
installling 36
opens. 36
Val, 36
quick! 36
used? 36
ass@@ 35
ings 35
pre@@ 35
ful@@ 35
migraine@@ 35
categories 35
int@@ 35
est@@ 35
*@@ 35
Anything 35
